package questions;

public class Asks {
    //1.
    //2. Они бывают public, default, private, protected.
    //3. это что-то наподобии полочек они нужны для удобства, так же если надо создать классы с одинаково то их можно разместить в разные package.
    //4. public работает везде, а default только в своем классе или пакете
    //5. ну может для того чтобы кто другой не вносил в наш класс изменения делаем сеттер приватным, а геттер т.к вывод нам нужен не в нашем классе, а в каком нибудь другом
}
